app/controllers/keywords_controller.rb

  def index
    @keywords = Keyword.all
---
SELECT * FROM "keywords"

  def show
    @keyword = Keyword.find(params[:id])
---
SELECT * FROM "keywords" WHERE ("keywords".site_id = 2)

  def create
    @keyword = Keyword.new(params[:keyword])

    respond_to do |format|
      if @keyword.save
---
INSERT INTO "keywords" ("created_at", "word", "updated_at", "site_id") VALUES('2009-11-23 21:21:16', 'find', '2009-11-23 21:21:16', 1)