app/controllers/sites_controller.rb

	def new

    @site = Site.new(params[:site])
		@site.save
---
INSERT INTO "sites" ("name", "created_at", "updated_at", "url") VALUES(NULL, '2009-11-11 22:02:31', '2009-11-11 22:02:31', NULL)