app/controllers/sites_controller.rb

SELECT * FROM "sites" WHERE (lower(name) like '%amazon%') LIMIT 1
INSERT INTO "requests" ("created_at", "term", "updated_at", "ip", "site_id") VALUES('2009-11-14 10:47:48', 'Good book', '2009-11-14 10:47:48', '127.0.0.1', 3)
---
	def show
		@show = params[:site][:id]
    logger.info { @show }
    # @allurls = Site.find(:all, :conditions=>["id =  ?", "%"+@show+"%"], :order => 'name ASC')
		@url = Site.find(:first, :conditions=>["id =  ?", "%"+@show+"%"])
		@term = params[:term]
    user_ip = request.remote_ip
    user_agent = request.user_agent
    puts user_agent
		@request = Request.new(:site_id => @url.id, :term => params[:term], :ip => user_ip)
		@request.save

INSERT INTO "sites" ("name", "created_at", "updated_at", "url") VALUES('Back to working', '2009-11-21 14:24:18', '2009-11-21 14:24:18', 'working.com')
---
	def create
		@site = Site.new(params[:site])
		@site.save

SELECT * FROM "sites" WHERE (name != "") ORDER BY name ASC
---
	def list
    @sites = Site.find(:all, :conditions => 'name != ""', :order => 'name ASC' )

SELECT * FROM "sites" WHERE ("sites"."id" = 2)
---
  def edit
    @site = Site.find(params[:id])